grevaillot/svd_tools/headers/ATSAM3X8H/usart0.h
#pragma once 

/* --- USART0: Universal Synchronous Asynchronous Receiver Transmitter 0  */

/** @defgroup usart0_registers Universal Synchronous Asynchronous Receiver Transmitter 0 Register
@{*/

/** USART0_CR Control Register **/
#define USART0_CR			MMIO32(USART0_BASE + 0x00)
/** USART0_CR_SPI_MODE Control Register **/
#define USART0_CR_SPI_MODE			MMIO32(USART0_BASE + 0x00)
/** USART0_MR Mode Register **/
#define USART0_MR			MMIO32(USART0_BASE + 0x04)
/** USART0_MR_SPI_MODE Mode Register **/
#define USART0_MR_SPI_MODE			MMIO32(USART0_BASE + 0x04)
/** USART0_IER Interrupt Enable Register **/
#define USART0_IER			MMIO32(USART0_BASE + 0x08)
/** USART0_IER_SPI_MODE Interrupt Enable Register **/
#define USART0_IER_SPI_MODE			MMIO32(USART0_BASE + 0x08)
/** USART0_IER_LIN_MODE Interrupt Enable Register **/
#define USART0_IER_LIN_MODE			MMIO32(USART0_BASE + 0x08)
/** USART0_IDR Interrupt Disable Register **/
#define USART0_IDR			MMIO32(USART0_BASE + 0x0c)
/** USART0_IDR_SPI_MODE Interrupt Disable Register **/
#define USART0_IDR_SPI_MODE			MMIO32(USART0_BASE + 0x0c)
/** USART0_IDR_LIN_MODE Interrupt Disable Register **/
#define USART0_IDR_LIN_MODE			MMIO32(USART0_BASE + 0x0c)
/** USART0_IMR Interrupt Mask Register **/
#define USART0_IMR			MMIO32(USART0_BASE + 0x10)
/** USART0_IMR_SPI_MODE Interrupt Mask Register **/
#define USART0_IMR_SPI_MODE			MMIO32(USART0_BASE + 0x10)
/** USART0_IMR_LIN_MODE Interrupt Mask Register **/
#define USART0_IMR_LIN_MODE			MMIO32(USART0_BASE + 0x10)
/** USART0_CSR Channel Status Register **/
#define USART0_CSR			MMIO32(USART0_BASE + 0x14)
/** USART0_CSR_SPI_MODE Channel Status Register **/
#define USART0_CSR_SPI_MODE			MMIO32(USART0_BASE + 0x14)
/** USART0_CSR_LIN_MODE Channel Status Register **/
#define USART0_CSR_LIN_MODE			MMIO32(USART0_BASE + 0x14)
/** USART0_RHR Receive Holding Register **/
#define USART0_RHR			MMIO32(USART0_BASE + 0x18)
/** USART0_THR Transmit Holding Register **/
#define USART0_THR			MMIO32(USART0_BASE + 0x1c)
/** USART0_BRGR Baud Rate Generator Register **/
#define USART0_BRGR			MMIO32(USART0_BASE + 0x20)
/** USART0_RTOR Receiver Time-out Register **/
#define USART0_RTOR			MMIO32(USART0_BASE + 0x24)
/** USART0_TTGR Transmitter Timeguard Register **/
#define USART0_TTGR			MMIO32(USART0_BASE + 0x28)
/** USART0_FIDI FI DI Ratio Register **/
#define USART0_FIDI			MMIO32(USART0_BASE + 0x40)
/** USART0_NER Number of Errors Register **/
#define USART0_NER			MMIO32(USART0_BASE + 0x44)
/** USART0_IF IrDA Filter Register **/
#define USART0_IF			MMIO32(USART0_BASE + 0x4c)
/** USART0_MAN Manchester Configuration Register **/
#define USART0_MAN			MMIO32(USART0_BASE + 0x50)
/** USART0_LINMR LIN Mode Register **/
#define USART0_LINMR			MMIO32(USART0_BASE + 0x54)
/** USART0_LINIR LIN Identifier Register **/
#define USART0_LINIR			MMIO32(USART0_BASE + 0x58)
/** USART0_LINBRR LIN Baud Rate Register **/
#define USART0_LINBRR			MMIO32(USART0_BASE + 0x5c)
/** USART0_WPMR Write Protection Mode Register **/
#define USART0_WPMR			MMIO32(USART0_BASE + 0xe4)
/** USART0_WPSR Write Protection Status Register **/
#define USART0_WPSR			MMIO32(USART0_BASE + 0xe8)
/** USART0_RPR Receive Pointer Register **/
#define USART0_RPR			MMIO32(USART0_BASE + 0x100)
/** USART0_RCR Receive Counter Register **/
#define USART0_RCR			MMIO32(USART0_BASE + 0x104)
/** USART0_TPR Transmit Pointer Register **/
#define USART0_TPR			MMIO32(USART0_BASE + 0x108)
/** USART0_TCR Transmit Counter Register **/
#define USART0_TCR			MMIO32(USART0_BASE + 0x10c)
/** USART0_RNPR Receive Next Pointer Register **/
#define USART0_RNPR			MMIO32(USART0_BASE + 0x110)
/** USART0_RNCR Receive Next Counter Register **/
#define USART0_RNCR			MMIO32(USART0_BASE + 0x114)
/** USART0_TNPR Transmit Next Pointer Register **/
#define USART0_TNPR			MMIO32(USART0_BASE + 0x118)
/** USART0_TNCR Transmit Next Counter Register **/
#define USART0_TNCR			MMIO32(USART0_BASE + 0x11c)
/** USART0_PTCR Transfer Control Register **/
#define USART0_PTCR			MMIO32(USART0_BASE + 0x120)
/** USART0_PTSR Transfer Status Register **/
#define USART0_PTSR			MMIO32(USART0_BASE + 0x124)

/**@}*/


/** @defgroup usart0_cr CR Control Register
@{*/

/** USART0_CR_LINWKUP Send LIN Wakeup Signal **/
#define USART0_CR_LINWKUP		(1 << 21)
/** USART0_CR_LINABT Abort LIN Transmission **/
#define USART0_CR_LINABT		(1 << 20)
/** USART0_CR_RTSDIS Request to Send Disable **/
#define USART0_CR_RTSDIS		(1 << 19)
/** USART0_CR_RTSEN Request to Send Enable **/
#define USART0_CR_RTSEN		(1 << 18)
/** USART0_CR_RETTO Rearm Time-out **/
#define USART0_CR_RETTO		(1 << 15)
/** USART0_CR_RSTNACK Reset Non Acknowledge **/
#define USART0_CR_RSTNACK		(1 << 14)
/** USART0_CR_RSTIT Reset Iterations **/
#define USART0_CR_RSTIT		(1 << 13)
/** USART0_CR_SENDA Send Address **/
#define USART0_CR_SENDA		(1 << 12)
/** USART0_CR_STTTO Start Time-out **/
#define USART0_CR_STTTO		(1 << 11)
/** USART0_CR_STPBRK Stop Break **/
#define USART0_CR_STPBRK		(1 << 10)
/** USART0_CR_STTBRK Start Break **/
#define USART0_CR_STTBRK		(1 << 9)
/** USART0_CR_RSTSTA Reset Status Bits **/
#define USART0_CR_RSTSTA		(1 << 8)
/** USART0_CR_TXDIS Transmitter Disable **/
#define USART0_CR_TXDIS		(1 << 7)
/** USART0_CR_TXEN Transmitter Enable **/
#define USART0_CR_TXEN		(1 << 6)
/** USART0_CR_RXDIS Receiver Disable **/
#define USART0_CR_RXDIS		(1 << 5)
/** USART0_CR_RXEN Receiver Enable **/
#define USART0_CR_RXEN		(1 << 4)
/** USART0_CR_RSTTX Reset Transmitter **/
#define USART0_CR_RSTTX		(1 << 3)
/** USART0_CR_RSTRX Reset Receiver **/
#define USART0_CR_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart0_cr_spi_mode CRSPIMODE Control Register
@{*/

/** USART0_CR_SPI_MODE_RCS Release SPI Chip Select **/
#define USART0_CR_SPI_MODE_RCS		(1 << 19)
/** USART0_CR_SPI_MODE_FCS Force SPI Chip Select **/
#define USART0_CR_SPI_MODE_FCS		(1 << 18)
/** USART0_CR_SPI_MODE_RSTSTA Reset Status Bits **/
#define USART0_CR_SPI_MODE_RSTSTA		(1 << 8)
/** USART0_CR_SPI_MODE_TXDIS Transmitter Disable **/
#define USART0_CR_SPI_MODE_TXDIS		(1 << 7)
/** USART0_CR_SPI_MODE_TXEN Transmitter Enable **/
#define USART0_CR_SPI_MODE_TXEN		(1 << 6)
/** USART0_CR_SPI_MODE_RXDIS Receiver Disable **/
#define USART0_CR_SPI_MODE_RXDIS		(1 << 5)
/** USART0_CR_SPI_MODE_RXEN Receiver Enable **/
#define USART0_CR_SPI_MODE_RXEN		(1 << 4)
/** USART0_CR_SPI_MODE_RSTTX Reset Transmitter **/
#define USART0_CR_SPI_MODE_RSTTX		(1 << 3)
/** USART0_CR_SPI_MODE_RSTRX Reset Receiver **/
#define USART0_CR_SPI_MODE_RSTRX		(1 << 2)

/**@}*/

