grevaillot/svd_tools/headers/ATSAM3X8H/usart0.h
/** @defgroup usart0_mr MR Mode Register
@{*/

/** USART0_MR_ONEBIT Start Frame Delimiter Selector **/
#define USART0_MR_ONEBIT		(1 << 31)
/** USART0_MR_MODSYNC Manchester Synchronization Mode **/
#define USART0_MR_MODSYNC		(1 << 30)
/** USART0_MR_MAN Manchester Encoder/Decoder Enable **/
#define USART0_MR_MAN		(1 << 29)
/** USART0_MR_FILTER Infrared Receive Line Filter **/
#define USART0_MR_FILTER		(1 << 28)

#define USART0_MR_MAX_ITERATION_SHIFT		24
#define USART0_MR_MAX_ITERATION_MASK		0x07
/** @defgroup usart0_mr_max_iteration MAXITERATION Maximum Number of Automatic Iteration
@{*/
/**@}*/

/** USART0_MR_INVDATA Inverted Data **/
#define USART0_MR_INVDATA		(1 << 23)
/** USART0_MR_VAR_SYNC Variable Synchronization of Command/Data Sync Start Frame Delimiter **/
#define USART0_MR_VAR_SYNC		(1 << 22)
/** USART0_MR_DSNACK Disable Successive NACK **/
#define USART0_MR_DSNACK		(1 << 21)
/** USART0_MR_INACK Inhibit Non Acknowledge **/
#define USART0_MR_INACK		(1 << 20)
/** USART0_MR_OVER Oversampling Mode **/
#define USART0_MR_OVER		(1 << 19)
/** USART0_MR_CLKO Clock Output Select **/
#define USART0_MR_CLKO		(1 << 18)
/** USART0_MR_MODE9 9-bit Character Length **/
#define USART0_MR_MODE9		(1 << 17)
/** USART0_MR_MSBF Bit Order **/
#define USART0_MR_MSBF		(1 << 16)

#define USART0_MR_CHMODE_SHIFT		14
#define USART0_MR_CHMODE_MASK		0x03
/** @defgroup usart0_mr_chmode CHMODE Channel Mode
@{*/
/**@}*/


#define USART0_MR_NBSTOP_SHIFT		12
#define USART0_MR_NBSTOP_MASK		0x03
/** @defgroup usart0_mr_nbstop NBSTOP Number of Stop Bits
@{*/
/**@}*/


#define USART0_MR_PAR_SHIFT		9
#define USART0_MR_PAR_MASK		0x07
/** @defgroup usart0_mr_par PAR Parity Type
@{*/
/**@}*/

/** USART0_MR_SYNC Synchronous Mode Select **/
#define USART0_MR_SYNC		(1 << 8)

#define USART0_MR_CHRL_SHIFT		6
#define USART0_MR_CHRL_MASK		0x03
/** @defgroup usart0_mr_chrl CHRL Character Length
@{*/
/**@}*/


#define USART0_MR_USCLKS_SHIFT		4
#define USART0_MR_USCLKS_MASK		0x03
/** @defgroup usart0_mr_usclks USCLKS Clock Selection
@{*/
/**@}*/


#define USART0_MR_USART_MODE_SHIFT		0
#define USART0_MR_USART_MODE_MASK		0x0f
/** @defgroup usart0_mr_usart_mode USARTMODE USART Mode of Operation
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_mr_spi_mode MRSPIMODE Mode Register
@{*/

/** USART0_MR_SPI_MODE_WRDBT Wait Read Data Before Transfer **/
#define USART0_MR_SPI_MODE_WRDBT		(1 << 20)
/** USART0_MR_SPI_MODE_CPOL SPI Clock Polarity **/
#define USART0_MR_SPI_MODE_CPOL		(1 << 16)
/** USART0_MR_SPI_MODE_CPHA SPI Clock Phase **/
#define USART0_MR_SPI_MODE_CPHA		(1 << 8)

#define USART0_MR_SPI_MODE_CHRL_SHIFT		6
#define USART0_MR_SPI_MODE_CHRL_MASK		0x03
/** @defgroup usart0_mr_spi_mode_chrl CHRL Character Length
@{*/
/**@}*/


#define USART0_MR_SPI_MODE_USCLKS_SHIFT		4
#define USART0_MR_SPI_MODE_USCLKS_MASK		0x03
/** @defgroup usart0_mr_spi_mode_usclks USCLKS Clock Selection
@{*/
/**@}*/


#define USART0_MR_SPI_MODE_USART_MODE_SHIFT		0
#define USART0_MR_SPI_MODE_USART_MODE_MASK		0x0f
/** @defgroup usart0_mr_spi_mode_usart_mode USARTMODE USART Mode of Operation
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_ier IER Interrupt Enable Register
@{*/

/** USART0_IER_MANE Manchester Error Interrupt Enable **/
#define USART0_IER_MANE		(1 << 24)
/** USART0_IER_CTSIC Clear to Send Input Change Interrupt Enable **/
#define USART0_IER_CTSIC		(1 << 19)
/** USART0_IER_NACK Non Acknowledge Interrupt Enable **/
#define USART0_IER_NACK		(1 << 13)
/** USART0_IER_RXBUFF Buffer Full Interrupt Enable (available in all USART modes of operation) **/
#define USART0_IER_RXBUFF		(1 << 12)
/** USART0_IER_TXBUFE Buffer Empty Interrupt Enable (available in all USART modes of operation) **/
#define USART0_IER_TXBUFE		(1 << 11)
/** USART0_IER_ITER Max number of Repetitions Reached Interrupt Enable **/
#define USART0_IER_ITER		(1 << 10)
/** USART0_IER_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART0_IER_TXEMPTY		(1 << 9)
/** USART0_IER_TIMEOUT Time-out Interrupt Enable **/
#define USART0_IER_TIMEOUT		(1 << 8)
/** USART0_IER_PARE Parity Error Interrupt Enable **/
#define USART0_IER_PARE		(1 << 7)
/** USART0_IER_FRAME Framing Error Interrupt Enable **/
#define USART0_IER_FRAME		(1 << 6)
/** USART0_IER_OVRE Overrun Error Interrupt Enable **/
#define USART0_IER_OVRE		(1 << 5)
/** USART0_IER_ENDTX End of Transmit Interrupt Enable (available in all USART modes of operation) **/
#define USART0_IER_ENDTX		(1 << 4)
/** USART0_IER_ENDRX End of Receive Transfer Interrupt Enable (available in all USART modes of operation) **/
#define USART0_IER_ENDRX		(1 << 3)
/** USART0_IER_RXBRK Receiver Break Interrupt Enable **/
#define USART0_IER_RXBRK		(1 << 2)
/** USART0_IER_TXRDY TXRDY Interrupt Enable **/
#define USART0_IER_TXRDY		(1 << 1)
/** USART0_IER_RXRDY RXRDY Interrupt Enable **/
#define USART0_IER_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_ier_spi_mode IERSPIMODE Interrupt Enable Register
@{*/

/** USART0_IER_SPI_MODE_RXBUFF  **/
#define USART0_IER_SPI_MODE_RXBUFF		(1 << 12)
/** USART0_IER_SPI_MODE_TXBUFE  **/
#define USART0_IER_SPI_MODE_TXBUFE		(1 << 11)
/** USART0_IER_SPI_MODE_UNRE SPI Underrun Error Interrupt Enable **/
#define USART0_IER_SPI_MODE_UNRE		(1 << 10)
/** USART0_IER_SPI_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART0_IER_SPI_MODE_TXEMPTY		(1 << 9)
/** USART0_IER_SPI_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART0_IER_SPI_MODE_OVRE		(1 << 5)
/** USART0_IER_SPI_MODE_ENDTX  **/
#define USART0_IER_SPI_MODE_ENDTX		(1 << 4)
/** USART0_IER_SPI_MODE_ENDRX  **/
#define USART0_IER_SPI_MODE_ENDRX		(1 << 3)
/** USART0_IER_SPI_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART0_IER_SPI_MODE_TXRDY		(1 << 1)
/** USART0_IER_SPI_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART0_IER_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_ier_lin_mode IERLINMODE Interrupt Enable Register
@{*/

/** USART0_IER_LIN_MODE_LINSNRE LIN Slave Not Responding Error Interrupt Enable **/
#define USART0_IER_LIN_MODE_LINSNRE		(1 << 29)
/** USART0_IER_LIN_MODE_LINCE LIN Checksum Error Interrupt Enable **/
#define USART0_IER_LIN_MODE_LINCE		(1 << 28)
/** USART0_IER_LIN_MODE_LINIPE LIN Identifier Parity Interrupt Enable **/
#define USART0_IER_LIN_MODE_LINIPE		(1 << 27)
/** USART0_IER_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error Interrupt Enable **/
#define USART0_IER_LIN_MODE_LINISFE		(1 << 26)
/** USART0_IER_LIN_MODE_LINBE LIN Bus Error Interrupt Enable **/
#define USART0_IER_LIN_MODE_LINBE		(1 << 25)
/** USART0_IER_LIN_MODE_LINTC LIN Transfer Completed Interrupt Enable **/
#define USART0_IER_LIN_MODE_LINTC		(1 << 15)
/** USART0_IER_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received Interrupt Enable **/
#define USART0_IER_LIN_MODE_LINID		(1 << 14)
/** USART0_IER_LIN_MODE_LINBK LIN Break Sent or LIN Break Received Interrupt Enable **/
#define USART0_IER_LIN_MODE_LINBK		(1 << 13)
/** USART0_IER_LIN_MODE_RXBUFF  **/
#define USART0_IER_LIN_MODE_RXBUFF		(1 << 12)
/** USART0_IER_LIN_MODE_TXBUFE  **/
#define USART0_IER_LIN_MODE_TXBUFE		(1 << 11)
/** USART0_IER_LIN_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART0_IER_LIN_MODE_TXEMPTY		(1 << 9)
/** USART0_IER_LIN_MODE_TIMEOUT Time-out Interrupt Enable **/
#define USART0_IER_LIN_MODE_TIMEOUT		(1 << 8)
/** USART0_IER_LIN_MODE_PARE Parity Error Interrupt Enable **/
#define USART0_IER_LIN_MODE_PARE		(1 << 7)
/** USART0_IER_LIN_MODE_FRAME Framing Error Interrupt Enable **/
#define USART0_IER_LIN_MODE_FRAME		(1 << 6)
/** USART0_IER_LIN_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART0_IER_LIN_MODE_OVRE		(1 << 5)
/** USART0_IER_LIN_MODE_ENDTX  **/
#define USART0_IER_LIN_MODE_ENDTX		(1 << 4)
/** USART0_IER_LIN_MODE_ENDRX  **/
#define USART0_IER_LIN_MODE_ENDRX		(1 << 3)
/** USART0_IER_LIN_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART0_IER_LIN_MODE_TXRDY		(1 << 1)
/** USART0_IER_LIN_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART0_IER_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_idr IDR Interrupt Disable Register
@{*/

