grevaillot/svd_tools/headers/ATSAM3X8H/usart0.h
/** USART0_IDR_MANE Manchester Error Interrupt Disable **/
#define USART0_IDR_MANE		(1 << 24)
/** USART0_IDR_CTSIC Clear to Send Input Change Interrupt Disable **/
#define USART0_IDR_CTSIC		(1 << 19)
/** USART0_IDR_NACK Non Acknowledge Interrupt Disable **/
#define USART0_IDR_NACK		(1 << 13)
/** USART0_IDR_RXBUFF Buffer Full Interrupt Disable (available in all USART modes of operation) **/
#define USART0_IDR_RXBUFF		(1 << 12)
/** USART0_IDR_TXBUFE Buffer Empty Interrupt Disable (available in all USART modes of operation) **/
#define USART0_IDR_TXBUFE		(1 << 11)
/** USART0_IDR_ITER Max Number of Repetitions Reached Interrupt Disable **/
#define USART0_IDR_ITER		(1 << 10)
/** USART0_IDR_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART0_IDR_TXEMPTY		(1 << 9)
/** USART0_IDR_TIMEOUT Time-out Interrupt Disable **/
#define USART0_IDR_TIMEOUT		(1 << 8)
/** USART0_IDR_PARE Parity Error Interrupt Disable **/
#define USART0_IDR_PARE		(1 << 7)
/** USART0_IDR_FRAME Framing Error Interrupt Disable **/
#define USART0_IDR_FRAME		(1 << 6)
/** USART0_IDR_OVRE Overrun Error Interrupt Enable **/
#define USART0_IDR_OVRE		(1 << 5)
/** USART0_IDR_ENDTX End of Transmit Interrupt Disable (available in all USART modes of operation) **/
#define USART0_IDR_ENDTX		(1 << 4)
/** USART0_IDR_ENDRX End of Receive Transfer Interrupt Disable (available in all USART modes of operation) **/
#define USART0_IDR_ENDRX		(1 << 3)
/** USART0_IDR_RXBRK Receiver Break Interrupt Disable **/
#define USART0_IDR_RXBRK		(1 << 2)
/** USART0_IDR_TXRDY TXRDY Interrupt Disable **/
#define USART0_IDR_TXRDY		(1 << 1)
/** USART0_IDR_RXRDY RXRDY Interrupt Disable **/
#define USART0_IDR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_idr_spi_mode IDRSPIMODE Interrupt Disable Register
@{*/

/** USART0_IDR_SPI_MODE_RXBUFF  **/
#define USART0_IDR_SPI_MODE_RXBUFF		(1 << 12)
/** USART0_IDR_SPI_MODE_TXBUFE  **/
#define USART0_IDR_SPI_MODE_TXBUFE		(1 << 11)
/** USART0_IDR_SPI_MODE_UNRE SPI Underrun Error Interrupt Disable **/
#define USART0_IDR_SPI_MODE_UNRE		(1 << 10)
/** USART0_IDR_SPI_MODE_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART0_IDR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART0_IDR_SPI_MODE_OVRE Overrun Error Interrupt Disable **/
#define USART0_IDR_SPI_MODE_OVRE		(1 << 5)
/** USART0_IDR_SPI_MODE_ENDTX  **/
#define USART0_IDR_SPI_MODE_ENDTX		(1 << 4)
/** USART0_IDR_SPI_MODE_ENDRX  **/
#define USART0_IDR_SPI_MODE_ENDRX		(1 << 3)
/** USART0_IDR_SPI_MODE_TXRDY TXRDY Interrupt Disable **/
#define USART0_IDR_SPI_MODE_TXRDY		(1 << 1)
/** USART0_IDR_SPI_MODE_RXRDY RXRDY Interrupt Disable **/
#define USART0_IDR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_idr_lin_mode IDRLINMODE Interrupt Disable Register
@{*/

/** USART0_IDR_LIN_MODE_LINSNRE LIN Slave Not Responding Error Interrupt Disable **/
#define USART0_IDR_LIN_MODE_LINSNRE		(1 << 29)
/** USART0_IDR_LIN_MODE_LINCE LIN Checksum Error Interrupt Disable **/
#define USART0_IDR_LIN_MODE_LINCE		(1 << 28)
/** USART0_IDR_LIN_MODE_LINIPE LIN Identifier Parity Interrupt Disable **/
#define USART0_IDR_LIN_MODE_LINIPE		(1 << 27)
/** USART0_IDR_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error Interrupt Disable **/
#define USART0_IDR_LIN_MODE_LINISFE		(1 << 26)
/** USART0_IDR_LIN_MODE_LINBE LIN Bus Error Interrupt Disable **/
#define USART0_IDR_LIN_MODE_LINBE		(1 << 25)
/** USART0_IDR_LIN_MODE_LINTC LIN Transfer Completed Interrupt Disable **/
#define USART0_IDR_LIN_MODE_LINTC		(1 << 15)
/** USART0_IDR_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received Interrupt Disable **/
#define USART0_IDR_LIN_MODE_LINID		(1 << 14)
/** USART0_IDR_LIN_MODE_LINBK LIN Break Sent or LIN Break Received Interrupt Disable **/
#define USART0_IDR_LIN_MODE_LINBK		(1 << 13)
/** USART0_IDR_LIN_MODE_RXBUFF  **/
#define USART0_IDR_LIN_MODE_RXBUFF		(1 << 12)
/** USART0_IDR_LIN_MODE_TXBUFE  **/
#define USART0_IDR_LIN_MODE_TXBUFE		(1 << 11)
/** USART0_IDR_LIN_MODE_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART0_IDR_LIN_MODE_TXEMPTY		(1 << 9)
/** USART0_IDR_LIN_MODE_TIMEOUT Time-out Interrupt Disable **/
#define USART0_IDR_LIN_MODE_TIMEOUT		(1 << 8)
/** USART0_IDR_LIN_MODE_PARE Parity Error Interrupt Disable **/
#define USART0_IDR_LIN_MODE_PARE		(1 << 7)
/** USART0_IDR_LIN_MODE_FRAME Framing Error Interrupt Disable **/
#define USART0_IDR_LIN_MODE_FRAME		(1 << 6)
/** USART0_IDR_LIN_MODE_OVRE Overrun Error Interrupt Disable **/
#define USART0_IDR_LIN_MODE_OVRE		(1 << 5)
/** USART0_IDR_LIN_MODE_ENDTX  **/
#define USART0_IDR_LIN_MODE_ENDTX		(1 << 4)
/** USART0_IDR_LIN_MODE_ENDRX  **/
#define USART0_IDR_LIN_MODE_ENDRX		(1 << 3)
/** USART0_IDR_LIN_MODE_TXRDY TXRDY Interrupt Disable **/
#define USART0_IDR_LIN_MODE_TXRDY		(1 << 1)
/** USART0_IDR_LIN_MODE_RXRDY RXRDY Interrupt Disable **/
#define USART0_IDR_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_imr IMR Interrupt Mask Register
@{*/

/** USART0_IMR_MANE Manchester Error Interrupt Mask **/
#define USART0_IMR_MANE		(1 << 24)
/** USART0_IMR_CTSIC Clear to Send Input Change Interrupt Mask **/
#define USART0_IMR_CTSIC		(1 << 19)
/** USART0_IMR_NACK Non Acknowledge Interrupt Mask **/
#define USART0_IMR_NACK		(1 << 13)
/** USART0_IMR_RXBUFF Buffer Full Interrupt Mask (available in all USART modes of operation) **/
#define USART0_IMR_RXBUFF		(1 << 12)
/** USART0_IMR_TXBUFE Buffer Empty Interrupt Mask (available in all USART modes of operation) **/
#define USART0_IMR_TXBUFE		(1 << 11)
/** USART0_IMR_ITER Max Number of Repetitions Reached Interrupt Mask **/
#define USART0_IMR_ITER		(1 << 10)
/** USART0_IMR_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART0_IMR_TXEMPTY		(1 << 9)
/** USART0_IMR_TIMEOUT Time-out Interrupt Mask **/
#define USART0_IMR_TIMEOUT		(1 << 8)
/** USART0_IMR_PARE Parity Error Interrupt Mask **/
#define USART0_IMR_PARE		(1 << 7)
/** USART0_IMR_FRAME Framing Error Interrupt Mask **/
#define USART0_IMR_FRAME		(1 << 6)
/** USART0_IMR_OVRE Overrun Error Interrupt Mask **/
#define USART0_IMR_OVRE		(1 << 5)
/** USART0_IMR_ENDTX End of Transmit Interrupt Mask (available in all USART modes of operation) **/
#define USART0_IMR_ENDTX		(1 << 4)
/** USART0_IMR_ENDRX End of Receive Transfer Interrupt Mask (available in all USART modes of operation) **/
#define USART0_IMR_ENDRX		(1 << 3)
/** USART0_IMR_RXBRK Receiver Break Interrupt Mask **/
#define USART0_IMR_RXBRK		(1 << 2)
/** USART0_IMR_TXRDY TXRDY Interrupt Mask **/
#define USART0_IMR_TXRDY		(1 << 1)
/** USART0_IMR_RXRDY RXRDY Interrupt Mask **/
#define USART0_IMR_RXRDY		(1 << 0)

/**@}*/

