grevaillot/svd_tools/headers/ATSAM3X8H/usart0.h
#define USART0_RHR_RXCHR_SHIFT		0
#define USART0_RHR_RXCHR_MASK		0x1ff
/** @defgroup usart0_rhr_rxchr RXCHR Received Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_thr THR Transmit Holding Register
@{*/

/** USART0_THR_TXSYNH Sync Field to be Transmitted **/
#define USART0_THR_TXSYNH		(1 << 15)

#define USART0_THR_TXCHR_SHIFT		0
#define USART0_THR_TXCHR_MASK		0x1ff
/** @defgroup usart0_thr_txchr TXCHR Character to be Transmitted
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_brgr BRGR Baud Rate Generator Register
@{*/


#define USART0_BRGR_FP_SHIFT		16
#define USART0_BRGR_FP_MASK		0x07
/** @defgroup usart0_brgr_fp FP Fractional Part
@{*/
/**@}*/


#define USART0_BRGR_CD_SHIFT		0
#define USART0_BRGR_CD_MASK		0xffff
/** @defgroup usart0_brgr_cd CD Clock Divider
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_rtor RTOR Receiver Time-out Register
@{*/


#define USART0_RTOR_TO_SHIFT		0
#define USART0_RTOR_TO_MASK		0x1ffff
/** @defgroup usart0_rtor_to TO Time-out Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_ttgr TTGR Transmitter Timeguard Register
@{*/


#define USART0_TTGR_TG_SHIFT		0
#define USART0_TTGR_TG_MASK		0xff
/** @defgroup usart0_ttgr_tg TG Timeguard Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_fidi FIDI FI DI Ratio Register
@{*/


#define USART0_FIDI_FI_DI_RATIO_SHIFT		0
#define USART0_FIDI_FI_DI_RATIO_MASK		0x7ff
/** @defgroup usart0_fidi_fi_di_ratio FIDIRATIO FI Over DI Ratio Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_ner NER Number of Errors Register
@{*/


#define USART0_NER_NB_ERRORS_SHIFT		0
#define USART0_NER_NB_ERRORS_MASK		0xff
/** @defgroup usart0_ner_nb_errors NBERRORS Number of Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_if IF IrDA Filter Register
@{*/


#define USART0_IF_IRDA_FILTER_SHIFT		0
#define USART0_IF_IRDA_FILTER_MASK		0xff
/** @defgroup usart0_if_irda_filter IRDAFILTER IrDA Filter
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_man MAN Manchester Configuration Register
@{*/

/** USART0_MAN_DRIFT Drift Compensation **/
#define USART0_MAN_DRIFT		(1 << 30)
/** USART0_MAN_ONE Must Be Set to 1 **/
#define USART0_MAN_ONE		(1 << 29)
/** USART0_MAN_RX_MPOL Receiver Manchester Polarity **/
#define USART0_MAN_RX_MPOL		(1 << 28)

#define USART0_MAN_RX_PP_SHIFT		24
#define USART0_MAN_RX_PP_MASK		0x03
/** @defgroup usart0_man_rx_pp RXPP Receiver Preamble Pattern detected
@{*/
/**@}*/


#define USART0_MAN_RX_PL_SHIFT		16
#define USART0_MAN_RX_PL_MASK		0x0f
/** @defgroup usart0_man_rx_pl RXPL Receiver Preamble Length
@{*/
/**@}*/

/** USART0_MAN_TX_MPOL Transmitter Manchester Polarity **/
#define USART0_MAN_TX_MPOL		(1 << 12)

#define USART0_MAN_TX_PP_SHIFT		8
#define USART0_MAN_TX_PP_MASK		0x03
/** @defgroup usart0_man_tx_pp TXPP Transmitter Preamble Pattern
@{*/
/**@}*/


#define USART0_MAN_TX_PL_SHIFT		0
#define USART0_MAN_TX_PL_MASK		0x0f
/** @defgroup usart0_man_tx_pl TXPL Transmitter Preamble Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_linmr LINMR LIN Mode Register
@{*/

/** USART0_LINMR_PDCM PDC Mode **/
#define USART0_LINMR_PDCM		(1 << 16)

#define USART0_LINMR_DLC_SHIFT		8
#define USART0_LINMR_DLC_MASK		0xff
/** @defgroup usart0_linmr_dlc DLC Data Length Control
@{*/
/**@}*/

/** USART0_LINMR_WKUPTYP Wakeup Signal Type **/
#define USART0_LINMR_WKUPTYP		(1 << 7)
/** USART0_LINMR_FSDIS Frame Slot Mode Disable **/
#define USART0_LINMR_FSDIS		(1 << 6)
/** USART0_LINMR_DLM Data Length Mode **/
#define USART0_LINMR_DLM		(1 << 5)
/** USART0_LINMR_CHKTYP Checksum Type **/
#define USART0_LINMR_CHKTYP		(1 << 4)
/** USART0_LINMR_CHKDIS Checksum Disable **/
#define USART0_LINMR_CHKDIS		(1 << 3)
/** USART0_LINMR_PARDIS Parity Disable **/
#define USART0_LINMR_PARDIS		(1 << 2)

#define USART0_LINMR_NACT_SHIFT		0
#define USART0_LINMR_NACT_MASK		0x03
/** @defgroup usart0_linmr_nact NACT LIN Node Action
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_linir LINIR LIN Identifier Register
@{*/


#define USART0_LINIR_IDCHR_SHIFT		0
#define USART0_LINIR_IDCHR_MASK		0xff
/** @defgroup usart0_linir_idchr IDCHR Identifier Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_linbrr LINBRR LIN Baud Rate Register
@{*/


#define USART0_LINBRR_LINFP_SHIFT		16
#define USART0_LINBRR_LINFP_MASK		0x07
/** @defgroup usart0_linbrr_linfp LINFP Fractional Part after Synchronization
@{*/
/**@}*/


#define USART0_LINBRR_LINCD_SHIFT		0
#define USART0_LINBRR_LINCD_MASK		0xffff
/** @defgroup usart0_linbrr_lincd LINCD Clock Divider after Synchronization
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_wpmr WPMR Write Protection Mode Register
@{*/


#define USART0_WPMR_WPKEY_SHIFT		8
#define USART0_WPMR_WPKEY_MASK		0xffffff
/** @defgroup usart0_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** USART0_WPMR_WPEN Write Protection Enable **/
#define USART0_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup usart0_wpsr WPSR Write Protection Status Register
@{*/


#define USART0_WPSR_WPVSRC_SHIFT		8
#define USART0_WPSR_WPVSRC_MASK		0xffff
/** @defgroup usart0_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** USART0_WPSR_WPVS Write Protection Violation Status **/
#define USART0_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup usart0_rpr RPR Receive Pointer Register
@{*/


#define USART0_RPR_RXPTR_SHIFT		0
#define USART0_RPR_RXPTR_MASK		0xffffffff
/** @defgroup usart0_rpr_rxptr RXPTR Receive Pointer Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_rcr RCR Receive Counter Register
@{*/


#define USART0_RCR_RXCTR_SHIFT		0
#define USART0_RCR_RXCTR_MASK		0xffff
/** @defgroup usart0_rcr_rxctr RXCTR Receive Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_tpr TPR Transmit Pointer Register
@{*/


#define USART0_TPR_TXPTR_SHIFT		0
#define USART0_TPR_TXPTR_MASK		0xffffffff
/** @defgroup usart0_tpr_txptr TXPTR Transmit Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_tcr TCR Transmit Counter Register
@{*/


#define USART0_TCR_TXCTR_SHIFT		0
#define USART0_TCR_TXCTR_MASK		0xffff
/** @defgroup usart0_tcr_txctr TXCTR Transmit Counter Register
@{*/
/**@}*/


/**@}*/

